{
    "Total": "<p>Below is a Choropleth showing electric power generation (MWh) in the U.S. by state for the year 2024. The threat of climate change has led to a rise in alternative energy sources. Use the buttons below to see how the map changes as we analyze power usage from key renewable and traditional energy sources throughout the U.S.</p>",
    "Natural Gas": "<p>Natural gas continues to be the dominant energy source and sees sizable use across the U.S. Despite the rise in renewables, 43% of electricity generated in the U.S. in 2024 came from natural gas. Natural gas generation likely <a href='https://e360.yale.edu/digest/u.s.-has-already-hit-peak-natural-gas-report-says'>peaked in 2020</a> and is projected to decrease as use of alternative energy sources continues to increase.</p>", 
    "Solar Thermal and Photovoltaic": "<p>Solar energy usage has dramatically increased, mainly due to the <a href='https://www.integratesun.com/post/the-price-and-efficiency-journey-of-solar-panels-over-time'>steep drop</a> in solar photovoltaic module prices over the past several decades (from ~$100/watt in the 1970s to $0.20 to $0.30 per watt in 2024). Despite this, power generated from solar energy remains relatively low at only 5% of total electrical power in the U.S.</p>",
    "Hydroelectric Conventional": "<p>Hydroelectric power has a more established history as a renewable energy source than solar, though its usage is only slightly higher, accounting for about 6% of the total power for the U.S. in 2024.</p>", 
    "Wind": "<p>Wind is the most common renewable energy source in the U.S., accounting for 10.5% of the power generated nationwide (about as much as the combined power generated from solar and hydroelectric.)</p>", 
    "Coal": "<p>Coal power generation has seen the steepest drop due to the rise in renewable energy sources. Coal-fired generation capacity in the U.S. peaked at about <a href='https://ieefa.org/resources/us-track-close-half-coal-capacity-2026'>317.6 GW in 2011</a>. By 2024, this had dropped to below 200 GW.</p>",
    "Final": "<p>Now that you've gotten a run through of the common energy sources in the U.S., feel free to explore on your own. Use the dropdown boxes below to filter to specific energy source and month in the year to see how energy generation varies across the nation. Hovering over the state will provide you the exact amount of power generated for the selected energy source and month.</p>"
  }
  